let initialState={
    answerArray:
    {fingerPrint:undefined,
        answerArray:[
        { 
            value :0,
            question:'چا هي فندر كنهن اهڑي پرابكت جي تياري با سرگرمي یا کاروبار لاء استعمال نیندا. جيكي پاكستان جي قانون و ضابطي يا بين الاقوامی کنوینشتن به معاهدن تحت غیرقانوني چاٹایل آهن؟ چا هي فندز كنهن دواسازي با کاروبار پر اهژین دوائن جیت مار دوائن ہون او زون کي ختر كندر مادي جي تياري. پولي كلر بائفنیل (ذهريلي بو؛ واري مركب) جي تياري يا انهن جي واپار بر استعمال                               ',
            checkedone:1,
            checkedtwo:0,
        },
        
        { 
            value :0,
            question:"چا هي فندز كنهن دواسازي با کاروبار پر اهژین دوائن جیت مار دوائن ہون او زون کي ختر كندر مادي جي تياري. پولي كلر بائفنیل (ذهريلي بو؛ واري مركب) جي تياري يا انهن جي واپار بر استعمال كيا ويندا. جيكي عالمي سطح تي خارج قرار ڈنل یا پابندي مرهيل آهن؟",
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فند اهژي جهنگلي جيوت جي واپار یا ان جي مصنوعات لاء استعمال نیندا. جيكي خطري هيث آیل نسلن جي واپار بابت عالمی کنوینشن جي ضابطن هیث آندل آهن؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فند هشیارن ؟ گولا بارود جي تياري، بر استعمال نیندا؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:' چاهي فندز الكوحل وارن شربتن شر ابن جي تياري یا واپار تي خرچ كيا ويندا؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز تماك جې پیداوار یا واپار لاء استمال نیندا؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:' چا هي فندز جويا جي اذن و اهري قسم جي كاروباري ادارن لاء استعمال نیندا؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'ما هي فندز تابکار مدادي جي تياري یا واپار لاء استعمال تیندا (اهو طبي ساز و سامان، معیاري ضابطن جي پرک واري سامان توژي پئي جنهن سامان جي خريداري، تي لاگو نئو نئي، جتي تابکاري، چې سببن کی معمولی یا مناسب طور تي بال طور سمجهيو وچی ثو؟ ',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز ردي يا ردي، مان تیار ئیل سامان جي سرحد پار و اپار لاوم باسل کنوینشن ؟ بنیادی ضابطن تي عمل كرن کانسواء استعمال كيا ويندا؟ ',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز ایسبیتس (نہ گرندژ) کلیل فائبر، ریشن جي پیداوار یا واپار لاء استعمال نیندا؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز غیر مستحضر ماهیگیري، جي طريقن لاء استعمال نیندا، جهراوي بجلي جي جهنكن. ذماكیدار مواد یا سامو ندي ماحول پر ادائي كلومیٹر کان بگھو م سنهو چار استعمال كرن؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'جا هي فند غیر منظم / قدرتي پيلن مان كان وبن یا ان مان سامان جي تياري با آن چي کاروبار لاء استعمال نیندا؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چاهی فندر جبري پورهئی یا نقصانكار و استحصالی صورت و ارین پیداواری سرگرمین لاء استعمال نیندا؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چاهي فئېز اهڑی زمین حاصل كرن جي سرگرمين یا پابندي، باوجود اهڑی زمین استعمال كرن لاء خرچ كيا ويندا. جنهن جي نتيجي بر لذپلان تئي بیا معاشي مسئلا پيدا ثين؟',
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز كن اهترین سرگرمين جي استعمال نیندا. جن سان خاص حیثیت وارن قدرتي و خاص ماگن ء تكائن جي حيثيت ہر گھنائي يا تبديلي شامل هجي يا قانوني طور محفوظ قرار ڈنل علائقي مر اهلي كا سرگرمي هجي؟',
            serialNo:1,
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا فندر جو استعمال خطرناك كيميكلز جي خاص مقدار پر تیاري، واپار، ذخیرہ اندوزي، یا چرپر یا نقصانكار كيميكلز (پیٹرول، گاسلیت پین پیٹرولیم شین, تیكسٹائل رنگن و غیره) جي واپاري پيماني تي استعمال لاء كيو ويندو؟',
            serialNo:1,
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز اهزي پیداوار یا سرگرمین لاو استمال كيا ويندا. جن جي نتيجي بر مقامي مائهن جي  لذپلان ئي، سندن زمین، قدرتي وسيلن، اهر ثقافتي ورثي و استعمال هين رهندز روایتي ملكيتن تي منفي اثر پوي؟ ',
            serialNo:1,
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز اهزي پیداوار یا سرگرمین لاو استمال كيا ويندا. جن جي نتيجي بر مقامي مائهن جي  لذپلان ئي، سندن زمین، قدرتي وسيلن، اهر ثقافتي ورثي و استعمال هين رهندز روایتي ملكيتن تي منفي اثر پوي؟',
            serialNo:1,
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'چا هي فندز گري ختر نہ نیندڑ پیکنگ مٹیریل جهزوك استير وفور ؛ پلاستك جي تيلهين جي تياري اه ا ء واپار لاو استعمال نیندا؟',
            serialNo:1,
            checkedone:1,
            checkedtwo:0,
        },
        { 
            value :0,
            question:'ڇا توهان کي اعتراض آهي ته اسان توهان جي قرض جي عمل لاءِ توهان جي نادرا جي اي-ويرسيس(E verisys) ڪريون؟',
            serialNo:1,
            checkedone:1,
            checkedtwo:0,
        },
        ]
    }
}

export default function CustomerAnsReducer(currentState=initialState,action){
switch (action.type) {
    case "ANSWERARRAY":
        return {
            answerArray:action.payload,
        }   
    default:return currentState;
        
}
}